#include <iostream>
#include <windows.h>
#include <io.h>
#include <fcntl.h>

// 이 지시자는 파일 맨 위에 두는 게 좋습니다.
#pragma execution_character_set("utf-8")

void ShowMonsterLoading()
{
    UINT oldCP = GetConsoleOutputCP();
    SetConsoleOutputCP(65001);
    // R"( 와 )" 사이의 모든 내용은 있는 그대로 문자로 인식됩니다. (김준태)
    // 줄바꿈이나 특수문자 때문에 에러가 날 일이 없습니다.
    const char* frame1 = R"(
                ▒▒▒▒▒▒▒▒▒▒▒▒▒
           ▒▒▒░░░░░░░░░░░░░░░░░░░░▒▒▒
         ▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░▒▒
        ▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░░▒▒
       ▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▒▒
      ▒▒░░░░░░░░░░░░██  ░░░░░░░░██  ░░░░▒▒
     ▒▒░░░░░░░░░░░░░████░░░░░░░░████░░░░▒▒
     ░░░░░░░░░░░░░░░░████░░░░░░░░████░░░▒▒▒
    ░░░░░░░░░░░░░░▒▒▒░░░░░░▒▒▒░░░░░░░░░░▒▒
     ▒░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▒▒▒
       ▒▒▒░░░░░░░░░▒▒▒▒▒▒▒░░░░░░░░░░░▒▒▒
    )";

    const char* frame2 = R"(
                          ▒▒▒▒▒▒▒▒▒▒▒▒▒
                     ▒▒▒░░░░░░░░░░░░░░░░░░░░▒▒▒
                   ▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░▒▒
                 ▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▒▒
                ▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▒▒
                ▒▒░░░░░░░░░░░░██  ░░░░░░░░██  ░░░▒▒
              ▒▒░░░░░░░░░░░░░░████░░░░░░░░████░░░▒▒
             ░░░░░░░░░░░░░░░░░░████░░░░░░░░████░░▒▒▒
         ▒░░░░░░░░░░░░░░░░░▒▒▒░░░░░░▒▒▒░░░░░░░░░▒▓
       ▒░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▒▒
       ▒▒▒░░░░░░░░░▒▒▒▒▒▒▒░░░░░░░░░░░░▒▒▒
    )";

    for (int i = 0; i < 3; ++i)
    {
        system("cls");
        std::cout << "\n\n\n\n\n          [ 몬스터 데이터를 불러오는 중... ]" << std::endl;
        std::cout << frame1 << std::endl;
        Sleep(1000);

        system("cls");
        std::cout << "\n\n\n\n\n          [ 몬스터 데이터를 불러오는 중... ]" << std::endl;
        std::cout << frame2 << std::endl;
        Sleep(1000);
    }
    system("cls");
    SetConsoleOutputCP(oldCP);

}
